# FailureDefinitionId Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailureDefinitionId Constructor
FailureDefinitionId Class See Also
---
Creates a new FailureDefinitionId instance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FailureDefinitionId(
	Guid guid
)
```

Visual Basic
---
```text
Public Sub New ( _
	guid As Guid _
)
```

Visual C++
---
```text
public:
FailureDefinitionId(
	Guid guid
)
```

# ### Parameters
guid
    Type: System..::..GuidThe identifier for the FailureDefinitionId.
# See Also
FailureDefinitionId Class
Autodesk.Revit.DB Namespace